docs/在Windows11下使用MSVC并脱离VisualStudio转而使用任意编辑器.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-02 Mon 11:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kle" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0af63c9">1. 使用MSVC并脱离VisualStudio转而使用任意编辑器在Windows11下.org</a>
<ul>
<li><a href="#orgfee9149">1.1. 1. 为什么要使用MSVC并脱离VisualStudio？</a></li>
<li><a href="#org1f70308">1.2. 2. 使用做法</a>
<ul>
<li><a href="#org37e073d">1.2.1. (1) 下载安装</a></li>
<li><a href="#org7b17c6a">1.2.2. (2) 基本介绍</a></li>
<li><a href="#org851ea20">1.2.3. (3) 设置环境变量(临时)</a></li>
<li><a href="#org95448e0">1.2.4. (4) 使用MSVC(cl.exe)</a></li>
<li><a href="#orgebf2d7c">1.2.5. (5) "IDE"集成</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0af63c9" class="outline-2">
<h2 id="org0af63c9"><span class="section-number-2">1.</span> 使用MSVC并脱离VisualStudio转而使用任意编辑器在Windows11下.org</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfee9149" class="outline-3">
<h3 id="orgfee9149"><span class="section-number-3">1.1.</span> 1. 为什么要使用MSVC并脱离VisualStudio？</h3>
<div class="outline-text-3" id="text-1-1">
<p>
我想试试MSVC在cpp20实现的模块(module)特性，但我用不习惯VisualStudio这个定制性较差的IDE
</p>
</div>
</div>
<div id="outline-container-org1f70308" class="outline-3">
<h3 id="org1f70308"><span class="section-number-3">1.2.</span> 2. 使用做法</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org37e073d" class="outline-4">
<h4 id="org37e073d"><span class="section-number-4">1.2.1.</span> (1) 下载安装</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
从 <a href="https://visualstudio.microsoft.com/visual-cpp-build-tools">软软VSBT</a> 下载(V)isual (S)tudio (B)uild (T)ools 套件，其中VSBT就包含了MSVC(cl.exe)的编译器
</p>

<p>
其中，商业名称叫 <code>MSVC</code>
</p>

<p>
实际名称叫 <code>cl.exe</code> 因为 <b>cl代表着 "(c) compiler and (l)ink"(C语言编译器与链接器)</b> 的意思
</p>
</div>
</div>
<div id="outline-container-org7b17c6a" class="outline-4">
<h4 id="org7b17c6a"><span class="section-number-4">1.2.2.</span> (2) 基本介绍</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
找到 <code>vcvars32.bat, vcvars64.bat, vcvarsall.bat</code> 批处理脚本
</p>

<p>
其中，它们的作用是
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">序号</th>
<th scope="col" class="org-left">批处理脚本</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">vcvars32.bat</td>
<td class="org-left">生成32位的abi产物</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">vcvars64.bat</td>
<td class="org-left">生成64位的abi产物</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">vcvarsall.bat</td>
<td class="org-left">没试过，但可能是同时生成32位与64位的abi产物</td>
</tr>
</tbody>
</table>

<p>
比如在我个人的电脑是这样的（不要滥抄，在我的电脑上是这个路径，在你的电脑是不一定是这个路径）
</p>

<div class="org-src-container">
<pre class="src src-nil">C:\Program Files (x86)\Microsoft Visual Studio\2022\BuildTools\VC\Auxiliary\Build\
</pre>
</div>

<p>
反正通过任何文件搜索工具，搜索到名为 <code>vcvars32.bat, vcvars64.bat, vcvarsall.bat</code> 的所在目录就行
</p>
</div>
</div>
<div id="outline-container-org851ea20" class="outline-4">
<h4 id="org851ea20"><span class="section-number-4">1.2.3.</span> (3) 设置环境变量(临时)</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
打开cmd窗口，执行 <code>%comspec% /k "vcvars32.bat或vcvars64.bat或vcvarsall.bat的所在路径"</code> 来 <b>设置临时环境变量</b> 让 <code>cl.exe</code> 在当前会话中可用
</p>

<p>
其中 <code>comspec</code> 的语义应该是 <code>compiler specification(编译器规格说明书)</code> 的意思
</p>

<p>
比如
</p>

<div class="org-src-container">
<pre class="src src-nil">%comspec% /k "C:\Program Files (x86)\Microsoft Visual Studio\2022\BuildTools\VC\Auxiliary\Build\vcvars32.bat"  
%comspec% /k "C:\Program Files (x86)\Microsoft Visual Studio\2022\BuildTools\VC\Auxiliary\Build\vcvars64.bat"
%comspec% /k "C:\Program Files (x86)\Microsoft Visual Studio\2022\BuildTools\VC\Auxiliary\Build\vcvarsall.bat"  
</pre>
</div>

<p>
这跟 Visual Studio 上的 <code>生成32位构建文件(x86)、生成64位构建文件(x64)</code> 的作用是一样的，只不过这是 <b>从IDE快捷指令，转变成了cmd命令</b> 这样
</p>
</div>
</div>
<div id="outline-container-org95448e0" class="outline-4">
<h4 id="org95448e0"><span class="section-number-4">1.2.4.</span> (4) 使用MSVC(cl.exe)</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
等待一会，就可以使用 MSVC(cl.exe) 了
</p>

<div class="org-src-container">
<pre class="src src-nil"># 其中，"/" 是msdos特有的参数前缀名
# 实际上，它就相当于说 cl.exe -?(短参数) 或 cl.exe --?(长参数) 的这样的效果
cl.exe /?
</pre>
</div>

<p>
于是就可以正常使用了，比如 <code>cl.exe 114514.c</code> 比如 <code>cl.exe 1919810.cpp</code>
</p>
</div>
</div>
<div id="outline-container-orgebf2d7c" class="outline-4">
<h4 id="orgebf2d7c"><span class="section-number-4">1.2.5.</span> (5) "IDE"集成</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
我们使用 cmake 来在任意编辑器上，做到给人一种IDE很集成的效果
</p>

<p>
比如说在
</p>

<div class="org-src-container">
<pre class="src src-nil">./clcpp
  ./src
  CmakeLists.txt
</pre>
</div>

<p>
我们可以写一个这样的单文件配置
</p>

<div class="org-src-container">
<pre class="src src-cmake"># CMAKE基本信息
cmake_minimum_required(VERSION 3.30.0)
set(CMAKE_CXX_STANDARD 20)
set(CMAKE_CXX_STANDARD_REQUIRED ON)
set(CMAKE_BUILD_TYPE_Debug)

# 项目名称(clcpp)
project(clcpp LANGUAGES CXX)

# 进入到指定目录
include_directories(
  ${clcpp_SOURCE_DIR}/src
)

# 进入到指定文件
file(GLOB sources CONFIGURE_DEFENDS
  "${clcpp_SOURCE_DIR}/src/hello.cpp"
)

# 编译执行
add_executable(main ${sources})

# 添加目标(target)，运行后钩子
add_custom_target(run COMMAND $&lt;TARGET_FILE:main&gt;)
</pre>
</div>

<p>
于是我们在执行完 <code>%comspec% /k "vcvars32.bat或vcvars64.bat或vcvarsall.bat的所在路径</code> 后
</p>

<p>
并保证cmake环境确保正确后，就可以使用 <b>cmake + MSVC(cl.exe) + 任意编辑器的命令行窗口</b> 来得到一种类似集成IDE的使用体验了
</p>

<div class="org-src-container">
<pre class="src src-nil"># cmake3 的使用方法  
cmake -B build                      # cmake配置当前项目
cmake --build build                 # cmake编译当前项目
cmake --build build --target run    # cmake编译当前项目并运行  
</pre>
</div>

<p>
有人说，我这样介绍了这么多篇幅的cmake，其实最终只想得到类似集成IDE的体验？那我为啥不去用VS？
</p>

<blockquote>
<p>
首先还是那个习惯问题，我不喜欢VS的原因，是它【定制性很差】。
</p>

<p>
虽然我主力编辑器不用vim模态编辑哈，但如果去用VS的vim插件的话，只能安装名为 "vs vim" 的插件来使用
</p>

<p>
然后虽说基本的vim使用体验是有了，但它只是一个编辑模式，好像找不到能用vimscript去进行一些基本的定制
</p>

<p>
比如说我想这样，在VS的右下角显示实时时间
</p>

<p>
function! UpdateTime()
    let g:current<sub>time</sub> = strftime("%H %M")
    redrawstatus
endfunction
</p>

<p>
我记得我当时配置是配置了，但没有任何显示效果在VS上。
</p>

<p>
还有就是，我这个过程
</p>

<p>
其实就是在从 <code>VS + MSBuild + MSVC</code> 的生态中，迁移到了 <code>任意编辑器 + CMake + MSVC</code> 的生态
</p>

<p>
总之，大家喜欢哪个生态就去尝试用哪个咯&#x2026;..
</p>
</blockquote>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kle</p>
<p class="date">Created: 2025-06-02 Mon 11:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
